\! echo ===================================================================
\! echo пример отображени€ представлени€ скрывающего сложный синтаксис
\! echo SELECT * FROM fulltable;
\! echo ===================================================================

	SELECT * FROM fulltable;

\! echo ===================================================================
\! echo пример отображени€ представлени€ скрывающего столбцы
\! echo SELECT * FROM modelsNames;
\! echo ===================================================================

\! echo ѕолна€ таблица
SELECT * FROM models;

\! echo ѕредставление со скрытым столбцом
SELECT * FROM modelsNames;


\! echo ===================================================================
\! echo пример срабатывани€ триггера
\! echo пытаемс€ добавить в таблицу price_of_models запись в которой цена товара меньше себестоимости
\! echo INSERT INTO price_of_models VALUES (nextval('seq_pom'), 8, 4, true, 3500, 3000);
\! echo получаем сообщение об ошибке
\! echo ===================================================================

INSERT INTO price_of_models VALUES (nextval('seq_pom'), 8, 4, true, 1000, 3000);

\! echo ===================================================================
\! echo пример срабатывани€ триггера 
\! echo внесение изменений в столбец именуемый в представлении и родительской таблице поразному, через внесение изменений в представление
\! echo ===================================================================

\! echo выводим таблицу и представление в первоначальном виде

SELECT * FROM price_of_models;
SELECT * FROM fulltable;

\! echo вносим изменени€ в представление
\! echo UPDATE fulltable  SET from_supplier = 'true', price = 4000, prime_cost = 3500, name = 'Razor X7' WHERE name = 'Razor X7';

UPDATE fulltable  SET from_supplier = 'true', price = 4000, prime_cost = 3500, name = 'Razor X7' WHERE name = 'Razor X7';

\! echo провер€ем произошли ли изменени€ в представлении и таблице
SELECT * FROM price_of_models;
SELECT * FROM fulltable;

\! echo ===================================================================
\! echo примеры вызова функций с периодом: с 15-02-2018 по 22-02-2018 
\! echo ===================================================================
\! echo ѕрибыль в разрезах категорий техники:
\! echo SELECT * FROM profit_C('20180215','20180222');
SELECT * FROM profit_C('20180215','20180222');
\! echo ѕрибыль за период:
\! echo SELECT profit_Per('20180215','20180222');
SELECT profit_Per('20180215','20180222');
\! echo —умма продаж за указанный период:
\! echo SELECT sales_Summ('20180215','20180222');
SELECT sales_Summ('20180215','20180222');
\! echo  оличество проданной за период техники с разбивкой по наименовани€м техники :
\! echo SELECT * FROM quanTech_name('20180215','20180222');
SELECT * FROM quanTech_name('20180215','20180222');
\! echo  оличество проданной за период техники:
\! echo SELECT quanTechP('20180215','20180222');
SELECT quanTechP('20180215','20180222');

